{
    "name": "Electricity",
    "text": "A form of energy resulting from the existence of charged particles (such as electrons or protons), either statically as an accumulation of charge or dynamically as a current.",
    "enabled": true,
    "children": [
        {
            "name": "Electric_charge",
            "text": "Electric charge is the physical property of matter that causes it to experience a force when placed in an electromagnetic field.",
            "children": [
                {
                    "name": "Positive_charge",
                    "text": "A deficiency of electrons; having a higher electric potential",
                    "children": [
                        {
                            "name": "Electrons",
                            "text": "The electron is a subatomic particle with a negative elementary electric charge",
                            "size": 3938,
                            "children":[
                                {
                                    "name": "Proton",
                                    "text": "The proton is a subatomic particle with a positive electric charge of +1e elementary charge and mass slightly less than that of a neutron",
                                    "size": 94384
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Alternating_Current",
                    "text": "In alternating current (AC), the flow of electric charge periodically reverses direction. In direct current (DC, also dc), the flow of electric charge is only in one direction.",
                    "children": [
                        {
                            "name": "Direct_Current",
                            "text": "Direct current (DC) is the unidirectional flow of electric charge. Direct current is produced by sources such as batteries, thermocouples, solar cells, and commutator-type electric machines of the dynamo type. Direct current may flow in a conductor such as a wire, but can also flow through semiconductors, insulators, or even through a vacuum as in electron or ion beams.",
                            "size": 3534
                        }
                    ]
                },
                {
                    "name": "Electronics",
                    "text": "Electronics deals with electrical circuits that involve active electrical components such as vacuum tubes, transistors, diodes and integrated circuits, and associated passive electrical components and interconnection technologies. Commonly, electronic devices contain circuitry consisting primarily or exclusively of active semiconductors supplemented with passive elements; such a circuit is described as an electronic circuit.",
                    "children": [
                        {
                            "name": "Digital_circuits",
                            "text": "Digital circuits are electric circuits based on a number of discrete voltage levels. Digital circuits are the most common physical representation of Boolean algebra, and are the basis of all digital computers",
                            "size": 7074
                        }
                    ]
                },
                {
                    "name": "Logic_Gates",
                    "text": "In electronics, a logic gate is an idealized or physical device implementing a Boolean function; that is, it performs a logical operation on one or more logical inputs, and produces a single logical output. Depending on the context, the term may refer to an ideal logic gate, one that has for instance zero rise time and unlimited fan-out, or it may refer to a non-ideal physical device[1] (see Ideal and real op-amps for comparison)."
                },
                {
                    "name": "Resistor",
                    "text": "Actively shapes a telescope mirrors to prevent deformation due to external influences such as wind, temperature, mechanical stress. Without active optics, the construction of 8 metre class telescopes is not possible, nor would telescopes with segmented mirrors be feasible.",
                    "children": [
                        {
                            "name": "Ohms_Law",
                            "text": "Utilizing a high-speed camera with exposure times short enough (100 ms or less) that the changes in the atmosphere during the exposure are minimal, lucky imaging chooses optimum exposures least affected by the atmosphere and combines them into a single image, yielding a much higher resolution than is possible with a single long exposure.",
                            "size": 7074,
                            "children": [
                                {
                                    "name": "Hydraulic_analogy",
                                    "text": "The electronic–hydraulic analogy (derisively referred to as the drain-pipe theory by Oliver Lodge) is the most widely used analogy for electron fluid in a metal conductor.",
                                    "size": 1234
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}
